app/controllers/places_controller.rb

INSERT INTO "places" ("name", "latitude", "logitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Epic Tower"], ["latitude", 6.556272], ["logitude", 3.366405], ["created_at", "2019-06-03 13:53:18.303925"], ["updated_at", "2019-06-03 13:53:18.303925"]]
---
  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save